<template>
    <div class="agreement">
        <goBackNav title='建造工用户协议' :url='url'></goBackNav>
        <div class="contain">
            <p>
                <div>欢迎您使用“建造工”软件及服务！<br/>
“建造工”是深圳市建造工科技有限公司（以下简称“建造工”）版权所有的互联网软件。为使用建造工产品（以下统称“本产品”）及服务，您应当阅读并遵守本《用户协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，并选择接受或不接受。</div><br/>
<br/>
<div>除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本产品及相关服务。您的下载、安装、使用、登录等行为即视为您已阅读并同意本协议的约束。</div><br/>
<br/>
<div>如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。</div><br/>
<br/>
<div>一、协议适用主体范围<br/>
本协议是您与建造工之间关于您下载、安装、使用、登录本产品，以及使用本产品所订立的协议。</div><br/>
<br/>
<div>二、关于本产品<br/>
2.1 服务内容<br/>
服务内容是指通过本产品向用户提供的工程信息、建筑用工等相关信息与服务对接（简称“本服务”）。</div><br/>
<br/>
<div>2.2 服务形式<br/>
您通过手机等终端以客户端等形式使用本产品。当您使用本产品时，您应选择与您的终端、系统等相匹配的产品版本，否则，您可能无法正常使用本产品。</div><br/>
<br/>
<div>2.3 许可的范围<br/>
2.3.1 建造工给予您个人的、不可转让及非排他性的许可，以使用本产品。您可以为非商业目的在单一台终端设备上下载、安装、使用、登录本产品。</div><br/>
<br/>
<div>2.3.2 您可以制作本产品的一个副本，仅用作备份。备份副本必须包含原软件中含有的所有著作权信息。</div><br/>
<br/>
<div>2.3.3 本条及本协议其他条款未明示授权的其他一切权利仍由建造工保留，您在行使这些权利时须另外取得建造工的书面许可。建造工如果未行使前述任何权利，并不构成对该权利的放弃。</div><br/>
<br/>
<div>三、账号<br/>
使用本产品您可能需要注册一个账号，此账号是建造工创设的用于识别用户身份的数字标识。账号的所有权属于建造工。</div><br/>
<br/>
<div>3.1 账号的获取<br/>
您可以通过如下方式免费或有偿申请注册建造工账号，包括但不限于：<br/>
(1)  软件客户端；<br/>
(2)  参与建造工开展或授权开展的活动；<br/>
(3)  其他建造工授权的方式。<br/>
您完成申请注册程序后，依照建造工的业务规则获得该账号的使用权。 (完)</div><br/>
<br/>
<div>3.2 账号的使用<br/>
您可以按照建造工的业务规则用账号登录和使用建造工提供的服务。</div><br/>
<br/>
<div>3.3 账号的安全<br/>
您应妥善保管您的账号。<br/>
建造工与您共同负有维护账号安全的责任。建造工会采取并不断更新技术措施，努力保护您的账号在服务器端的安全。<br/>
您需要采取特定措施保护您的账号安全，包括但不限于妥善保管账号、短信验证码、安装防病毒木马软件等措施。</div><br/>
<br/>
<div>3.4 用户行为规范<br/>
您不得恶意注册本产品账号。建造工可以对恶意注册行为进行独立判断和处理。<br/>
账号的使用权仅属于初始申请注册人。未经建造工许可，您不得赠与、借用、租用、转让或售卖账号或者以其他方式许可非初始申请注册人使用账号。<br/>
如果您当前使用的账号并不是您初始申请注册的或者通过建造工提供的其他途径获得的，但您却知悉该账号，您不得用该账号登录或进行任何操作，并请您在第一时间通知建造工或者该号码的初始申请注册人。</div><br/>
<br/>
<div>3.5 责任承担<br/>
您理解并同意，作为账号的初始申请注册人和使用人，您应承担该号码项下所有活动产生的全部责任。<br/>
因建造工原因导致您的账号被盗，建造工将依法承担相应责任。非因建造工原因导致的，建造工不承担任何责任。<br/>
建造工依照业务规则限制、冻结或终止您的账号使用，可能会给您造成一定的损失，该损失由您自行承担，建造工不承担任何责任。<br/>
您不得有偿或无偿转让账号，以免产生纠纷。您应当自行承担由此产生的任何责任，同时建造工保留追究上述行为人法律责任的权利。</div><br/>
<br/>
<div>3.6 账号使用的限制、冻结或终止<br/>
如您违反法律法规、本协议或业务规则的规定，建造工有权进行独立判断并随时限制、冻结或终止您对账号的使用，且根据实际情况决定是否恢复使用。<br/>
如果建造工发现您并非号码初始申请注册人，建造工有权在未经通知的情况下终止您使用该账号。<br/>
为了充分利用账号资源，如果您存在注册账号后未及时进行初次登录使用，或长期未登陆使用账号等情形，建造工有权终止该号码的使用。<br/>
建造工按照本规则或相关法律法规，限制、冻结或终止您对账号的使用，而由此给您带来的损失（包括但不限于通信中断，用户资料、邮件和游戏道具及相关数据等的清空等），由您自行承担。</div><br/>
<br/>
<div>四、软件的获取<br/>
4.1 您可以直接从建造工的网站上获取本产品，也可以从得到建造工授权的第三方获取。</div><br/>
<br/>
<div>4.2 如果您从未经建造工授权的第三方获取本产品或与本产品名称相同的安装程序，建造工无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。</div><br/>
<br/>
<div>五、软件的安装与卸载<br/>
5.1 建造工可能为不同的终端、系统等开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。</div><br/>
<br/>
<div>5.2 下载安装程序后，您需要按照该程序提示的步骤正确安装。</div><br/>
<br/>
<div>5.3 为提供更加优质、安全的服务，在本产品安装时建造工可能推荐您安装其他软件，您可以选择安装或不安装。</div><br/>
<br/>
<div>5.4 如果您不再需要使用本产品或者需要安装新版软件，可以自行卸载。如果您愿意帮助建造工改进产品服务，请告知卸载的原因。</div><br/>
<br/>
<div>六、软件的更新<br/>
6.1 为了增进用户体验、完善服务内容，建造工将不断努力开发新的服务，并为您不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。</div><br/>
<br/>
<div>6.2 本产品可能为您默认开启自动升级、更新等功能，您可以在软件设置中自行选择是否需要开启此功能。</div><br/>
<br/>
<div>6.3 为了改善用户体验，并保证服务的安全性和功能的一致性，建造工有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。</div><br/>
<br/>
<div>6.4 本产品新版本发布后，旧版本的软件可能无法使用。建造工不保证旧版本产品继续可用及相应的客户服务，请您随时核对并下载最新版本。</div><br/>
<br/>
<div>七、用户个人信息保护<br/>
7.1 保护用户个人信息是建造工的一项基本原则，建造工将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可建造工不会向第三方公开、透露用户个人信息。建造工对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。</div><br/>
<br/>
<div>7.2 您在注册账号或使用本产品的过程中，可能需要填写一些必要的信息。若国家法律法规或政策有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本产品或在使用过程中受到限制。</div><br/>
<br/>
<div>7.3 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</div><br/>
<br/>
<div>7.4 建造工将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</div><br/>
<br/>
<div>7.5 建造工非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用本产品前，应事先取得您家长或法定监护人的书面同意。</div><br/>
<br/>
<div>八、用户行为规范
8.1 用户注意事项
8.1.1 您充分理解并同意：为了向您提供更好的网络社交服务，本产品的某些功能可能会让第三方知晓您的某些信息，包括但不限于您的建造工系统好友可以查询您提交的可公开的个人资料，以及为了方便好友与你进行在线交流，本产品的某些功能可能会获取并展示您的设备、网络状态等。您应了解本部分的信息公开和透露可能会给您带来潜在风险，并自行承担由此造成的风险。</div><br/>
<br/>
<div>8.1.2 您充分理解并同意：为改善、优化相应服务，建造工可能会对您的昵称、头像以及在本产品中的相关操作信息等信息进行使用，也可能通过建造工服务或建造工服务中的第三方提供的服务向您本人、其他用户展示您的相关信息。建造工也可能会基于保护您的账号安全等安全因素，收集、使用您的相关操作行为等信息。</div><br/>
<br/>
<div>8.1.3 您充分理解并同意：您在使用本产品某一特定服务时，本产品可以使用您终端设备的相关权限、接口及相关信息等以实现相应的功能，某些特定服务可能还需同意单独的协议、规则等，您在使用该项服务前请仔细阅读前述相关协议、规则。</div><br/>
<br/>
<div>8.1.4 建造工有权在本产品中或通过本产品向您展现各种信息，包括但不限于广告信息、新闻信息及宣传信息等，该信息可能以系统消息或弹出窗口等形式出现。</div><br/>
<br/>
<div>8.1.5 您可以选择不向建造工提供您的某些信息，或者根据产品设置取消建造工收集某些信息，但因此可能会导致相关服务功能无法实现。</div><br/>
<br/>
<div>8.1.6 您理解并同意建造工将会尽其商业上的合理努力保障您在本产品及服务中的数据存储安全。但是，建造工并不能就此提供完全保证，包括但不限于以下情形：<br/>
  (1)  建造工不对您在本产品及服务中相关数据的删除或储存失败负责；   (2)  建造工有权根据实际情况自行决定您在本产品及服务中数据的最长储存期限、服务器中数据的最大存储空间等，您可根据自己的需要自行备份本产品及服务中的相关数据。双方另有约定的按相应约定执行；   (3)  果您停止使用本产品及服务或服务被终止或取消，建造工可以从服务器上永久地删除您的数据。您的服务停止、终止或取消后，建造工没有义务向您返还任何数据。</div><br/>
<br/>
<div>8.1.7 本产品内的运营活动均由建造工或第三方举办，除有特别声明外，活动中提供的奖品生产商（如奖品为苹果手机的苹果公司，下同）等均未参与本产品内的运营活动，活动中涉及到的奖品，也均由建造工或第三方自行购买。因运营活动产生纠纷的，由建造工或第三方在法律规定的范围内承担责任，与奖品生产商无关。因活动奖品质量产生纠纷的,按照相关法律规定处理。</div><br/>
<br/>
<div>8.1.8 您使用本产品时，本产品的内容可能会因您使用软件版本的不同而有差别，您理解并同意当您在使用本产品的某些版本开通或进入建造工开发的应用分发类产品或应用分发类功能的相关页面时，此应用分发类产品或功能，为更好地向您提供终端设备上应用的升级提示等智能服务，可能会使用您终端设备上已经安装应用程序的版本信息、安装位置、大小等必要信息，具体以建造工实际提供的版本为准。</div><br/>
<br/>
<div>8.1.9 本产品可能会向您提供一些与地理位置、工种、班组类别、兴趣爱好等信息相关的基于非好友用户之间的扩展的功能，您使用这些功能即表示您同意本产品获取、使用您的地理位置、兴趣爱好等信息。同时，您理解并同意在前述相关功能中，相关信息的发布由用户自行发布，并自行确保其合法、健康、真实以及自行承担相关法律责任； 您应自行通过各种手段认真核实相关用户及其发布信息的合法性、真实性，若您与其他用户涉及线下见面、约会或交友等各种实体活动的，在进行线下活动时，要注意保护好自己的人生、财产安全；同时，建造工在前述相关功能中，仅提供技术支持和平台服务，基于互联网虚拟的特性，建造工无法核实相关用户及发布信息的真实性、合法性，也无法向您提供任何保证，若由于前述相关功能，导致您在线上、线下有任何人身、财产损失的，您同意自行承担全部责任，与建造工无关也不会追究建造工的任何责任。</div><br/>
<br/>
<div>8.2 使用本产品的行为限制<br/>
您在使用本产品时不得利用本产品从事以下行为，包括但不限于：<br/>
  (1)  发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽、暴力的内容；<br/>
  (2)  发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；<br/>
  (3)  虚构事实、隐瞒真相以误导、欺骗他人；<br/>
  (4)  发表、传送、传播广告信息及垃圾信息；<br/>
  (5)  从事其他违反法律法规、政策及公序良俗、社会公德等的行为。</div><br/>
<br/>
<div>8.3 用户禁止行为<br/>
除非法律允许或建造工书面许可，您不得从事下列行为：<br/>
  (1)  删除本产品及其副本上关于著作权的信息；<br/>
  (2)  对本产品进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本产品的源代码；<br/>
  (3)  对建造工拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；<br/>
  (4)  对本产品或者本产品运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据、以及本产品运行所必需的系统数据等，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非建造工经授权的第三方工具/服务接入本产品和相关系统；<br/>
  (5)  通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；<br/>
  (6)  通过非建造工开发、授权的第三方软件、插件、外挂、系统，登录或使用建造工软件及服务，或制作、发布、传播上述工具；<br/>
  (7)  自行、授权他人或利用第三方软件对本产品及其组件、模块、数据等进行干扰；<br/>
  (8)  通过本产品向其他用户发送大量信息；<br/>
  (9)  其他未经建造工明示授权、许可或违反本协议及相关协议、规则的行为。</div><br/>
<br/>
<div>8.4 对自己行为负责<br/>
您充分了解并同意，您必须为自己注册账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对使用本产品时接触到的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。建造工无法且不会对您因前述风险而导致的任何损失或损害承担责任。</div><br/>
<br/>
<div>8.5 违约处理<br/>
如果建造工发现或收到他人举报您有违反本协议约定的，建造工有权不经通知随时对相关内容进行删除、屏蔽，并采取包括但不限于暂停、终止您使用相应账号，暂停、终止您使用部分或全部本产品，追究法律责任等措施。</div><br/>
<br/>
<div>8.6 对第三方损害的处理
您违反约定，导致任何第三方损害的，您应当独立承担法律责任；建造工因此遭受损失的，您也应当一并赔偿。</div><br/>
<br/>
<div>九、第三方提供的产品或服务
您在建造工平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。建造工和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。<br/>
因用户使用本产品或要求建造工提供特定服务时，本产品可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供（包括但不限于您通过本产品跳转到的第三方提供的服务及内容，第三方通过建造工开放平台接入的服务及内容等），建造工无法保证第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，您应自行承担相关责任。</div><br/>
<br/>
<div>十、知识产权声明<br/>
10.1 建造工是本产品的知识产权权利人。本产品的著作权、商标权、专利权、商业秘密等知识产权，以及与本产品相关的所有信息内容（包括但不限于文字、图片、音频、 视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，建造工依法享有上述相关知识产权，但相关权利人依照法律规定应享有的权利除外。</div><br/>
<br/>
<div>10.2 未经建造工或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。</div><br/>
<br/>
<div>十一、终端安全责任<br/>
11.1 您理解并同意，本产品同大多数互联网软件、产品一样，可能会受多种因素影响（包括但不限于用户原因、网络服务质量、社会环境等）；也可能会受各种安全问题的侵扰（包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您终端的信息和数据的安全，继而影响本产品的正常使用等）。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。</div><br/>
<br/>
<div>11.2 您不得制作、发布、使用、传播用于窃取建造工软件及他人个人信息、财产的恶意程序。</div><br/>
<br/>
<div>11.3 维护软件安全与正常使用是建造工和您的共同责任，建造工将按照行业标准合理审慎地采取必要技术措施保护您的终端信息和数据安全，但是您承认和同意建造工不能就此提供任何保证。</div><br/>
<br/>
<div>11.4 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意建造工有关防范诈骗犯罪的提示。</div><br/>
<br/>
<div>十二、第三方软件或技术<br/>
12.1 本产品可能会使用第三方软件或技术（包括本产品可能使用的开源代码和公共领域代码等），这种使用已经获得合法授权。</div><br/>
<br/>
<div>12.2 本产品如果使用了第三方的软件或技术，建造工将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本产品安装包特定文件夹中打包等形式进行展示，它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议或其他文件，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求建造工给予协助，您应当自行承担法律责任。</div><br/>
<br/>
<div>十三、其他<br/>
13.1 您使用本产品即视为您已阅读并同意受本协议的约束。建造工有权在必要时修改本协议条款。您可以在本产品的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本产品，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本产品。</div><br/>
<br/>
<div>13.2 本协议签订地为中华人民共和国广东省深圳市。</div><br/>
<br/>
<div>13.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</div><br/>
<br/>
<div>13.4 若您和建造工之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</div><br/>
<br/>
<div>13.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</div><br/>
<br/>
<div>13.6 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</div><br/>
<br/>
<div>13.7 若本协议有中文、英文等多个语言版本，相应内容不一致的，均以中文版的内容为准。（完）</div><br/>
<br/>
<div>深圳市建造工科技有限公司</div><br/>
        </div>
    </div>
</template>

<script>
import goBackNav from "@/components/goBackNav.vue";
export default {
    components: {
        goBackNav
    },
    data() {
        return {
            url:''
        }
    },
    mounted() {
        let This = this
        This.url = getCurrentPages()
        console.log(This.url)
        This.url = This.url[0].__displayReporter.showReferpagepath.split('.')
        This.url = '/' +  This.url[0]
        console.log(This.url)
    },
};
</script>
<style lang="scss" scoped>
.agreement {
    position: absolute;
    width: 100%;
    height: 100%;
    .contain {
        width: 670rpx;
        height: auto;
        margin: 0 auto;
    }
    .title {
        font-size: 48rpx;
        color: rgb(51, 51, 51);
        font-family: "PingFangSC-Regular";
        font-weight: 550;
    }
    div{
        margin-bottom: 40rpx;
    }
}
</style>
